CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/protocol/wisun/stack/inc/socket/socket.h
/***************************************************************************//**
 * @file socket.h
 * @brief socket API
 *******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifndef __SOCKET_H__
#define __SOCKET_H__

#ifdef __cplusplus
extern "C" {
#endif

#include <stddef.h>
#include <stdint.h>
#include "sl_status.h"
#include "sl_common.h"

#ifndef __ssize_t_defined
typedef int ssize_t;
# define __ssize_t_defined
#endif

/// Socket API error return value
#define SOCKET_RETVAL_ERROR                   (-1L)
/// Socket API OK return value
#define SOCKET_RETVAL_OK                      (0L)
/// Invalid socket ID
#define SOCKET_INVALID_ID                     (SOCKET_RETVAL_ERROR)

/// Initialization value for IPv6 wildcard address
#define IN6ADDR_ANY_INIT { { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } }

/**************************************************************************//**
 * @addtogroup SL_WISUN_SOCKET_API Socket API
 * @ingroup SL_WISUN_API
 * @{
 *****************************************************************************/

/** \name Ancillary data object information MACROS */
///@{
/** \brief Returns the length of the data with the required alignment
 *  \param len The length of the data in bytes
 *  \return The aligned length of the data, rounded up to the nearest multiple of uint32_t
 */
#define CMSG_ALIGN(len) ( ((len) + sizeof(uint32_t) - 1) & (~(sizeof(uint32_t) - 1)) )

/** \brief Returns the number of bytes an ancillary element with payload of the passed data length occupies
 *  \param len The length of the data in bytes
 *  \return The size of the control message structure plus the aligned data length
 */
#define CMSG_SPACE(len) (sizeof(struct cmsghdr) + CMSG_ALIGN(len))

/** \brief Returns the value to store in the cmsg_len member of the cmsghdr structure
 *  \param len The length of the data in bytes
 *  \return The size of the control message structure plus the data length
 */
#define CMSG_LEN(len) (sizeof(struct cmsghdr) + (len))

/** \brief Returns a pointer to the first control message header in the given msghdr structure
 *  \param mhdr A pointer to a msghdr structure that contains the control message buffer
 *  \return A pointer to the first cmsghdr structure, or NULL if the buffer is empty or invalid
 */
#define CMSG_FIRSTHDR(mhdr)                                     \
        ((mhdr)->msg_controllen >= sizeof(struct cmsghdr) ?     \
        (struct cmsghdr *)(mhdr)->msg_control :                 \
        (struct cmsghdr *) NULL)

/** \brief Returns a pointer to the next control message header in the ancillary data buffer
 *  \param mhdr A pointer to a msghdr structure that contains the control message buffer
 *  \param cmsg A pointer to the current cmsghdr structure
 *  \return A pointer to the next cmsghdr structure, or NULL if there is no more space left in the buffer
 */
#define CMSG_NXTHDR(mhdr, cmsg) cmsg_nxthdr((mhdr), (cmsg))

/** \brief Returns a pointer to the data portion of a cmsghdr
 *  \param cmsg A pointer to a cmsghdr structure
 *  \return A pointer to the data following the cmsghdr, casted to uint8_t *
 */
#define CMSG_DATA(cmsg) ((uint8_t *)(cmsg) + CMSG_ALIGN(sizeof(cmsghdr_t)))
///@}

/** \name Flags we can use with recv(), recvfrom() and recvmsg() */
///@{
#define MSG_TRUNC  0x0001  ///< Normal data truncated, to be used as msg_flags field in the msghdr structure.
#define MSG_CTRUNC 0x0002  ///< Control data truncated, to be used as msg_flags field in the msghdr structure.
#define MSG_PEEK   0x0004  ///< Leave received data in queue, to be used as the flags parameter.
///@}

/** \name Protocol levels used for socket_setsockopt. */
///@{
#define SOL_SOCKET           0   ///< Socket option level
#define SOL_APPLICATION      1   ///< Application socket option level
#define IPPROTO_IPV6        41   ///< IPV6 socket option level
///@}

// For backward compatibility
#define APP_LEVEL_SOCKET     SOL_APPLICATION

/** \name Option names for application level */

/** \name application level socket options
 *
 * application level socket options summary
 *
 * | opt_name              | data type         | set/get         | sendmsg | recvmsg |
 * | :-------------------: | :---------- ----: | :-------------: | :-----: | :-------|
 * | SO_EVENT_MODE         | int16_t           |     Set only    |   No    | Yes     |
 * | SO_NONBLOCK           | int16_t           |     Set only    |   Yes   | Yes     |
 */

///@{
/// Specify event mode of a socket.
/// When set, optval must point to an uint32_t.
///
/// Possible values are:
/// - #SL_WISUN_SOCKET_EVENT_MODE_INDICATION: received data is included in
///   SL_WISUN_MSG_SOCKET_DATA_IND_ID indication
///
/// - #SL_WISUN_SOCKET_EVENT_MODE_POLLING: only the amount of received data is
///   included #SL_WISUN_MSG_SOCKET_DATA_AVAILABLE_IND_ID indication. recv() or
///   recvfrom() shouldbe invoked after indication reception to retrieve data
#define SO_EVENT_MODE           10
#define SOCKET_EVENT_MODE       SO_EVENT_MODE

