CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/protocol/wisun/stack/inc/socket/socket.h
/// Enable/disable nonblocking mode.
/// This option takes an uint32_t value.
///
/// Possible values are:
///   - (1) enables nonblocking mode
///   - (0) disables nonblocking mode
#define   SO_NONBLOCK             11
///@}

/** \name Option names for socket level. */

/** \name socket level options
 *
 * socket level options summary
 *
 * | opt_name              | data type         | set/get         | sendmsg | recvmsg |
 * | :-------------------: | :---------- ----: | :-------------: | :-----: | :-------|
 * | SO_RCVBUF             | int32_t           |     Set/Get     |   No    | Yes     |
 * | SO_SNDBUF             | int32_t           |     Set/Get     |   Yes   | No      |
 * | SO_SNDLOWAT           | int32_t           |     Set/Get     |   Yes   | No      |
 */

///@{
/// Specify receive buffer size in payload bytes.
/// When set, optval must point to an int32_t.
///
/// 0 means unread data are dropped, unless read in data callback.
#define SO_RCVBUF                    1

/// Specify send buffer size in payload bytes.
/// When set, optval must point to an int32_t.
///
/// Used only for stream sockets.
#define SO_SNDBUF                    2

/// Specify send low water mark in payload bytes.
/// When set, optval must point to an int32_t.
#define SO_SNDLOWAT                  4

///@}

/** \name Socket DSCP (Differentiated Services Code Point) QoS supported levels.
 */
///@{
/** Standard priority and it is socket default */
#define DSCP_DEFAULT 0
/** Application high priority service: Stack priorities these messages over the default priority messages */
#define DSCP_AF11 10
/** Expedited Forwarding (EF) QoS level enable high priority state: low loss, low delay, and low jitter services */
#define DSCP_EF 46
///@}


/** \name Option names for IPv6 protocol level */

/**  \name IPv6 socket options
 * IPv6 socket options summary
 *
 * | opt_name              | Data type         | set/getsockopt  | sendmsg | recvmsg |
 * | :-------------------: | :---------- ----: | :-------------: | :-----: | :-------|
 * | IPV6_TCLASS           | int               |     Set/Get     |   Yes   | No      |
 * | IPV6_UNICAST_HOPS     | int               |     Set/Get     |   No    | No      |
 * | IPV6_MULTICAST_HOPS   | int               |     Set/Get     |   No    | No      |
 * | IPV6_USE_MIN_MTU      | int               |     Set/Get     |   Yes   | No      |
 * | IPV6_HOPLIMIT         | int               |     None        |   Yes   | Yes     |
 * | IPV6_RECVHOPLIMIT     | int               |     Set/Get     |   No    | No      |
 * | IPV6_MULTICAST_LOOP   | int               |     Set/Get     |   Yes   | No      |
 * | IPV6_JOIN_GROUP       | ipv6_mreq_t       |     Set only    |   No    | No      |
*  | IPV6_ADD_MEMBERSHIP   | ipv6_mreq_t       |     Set only    |   No    | No      |
 * | IPV6_LEAVE_GROUP      | ipv6_mreq_t       |     Set only    |   No    | No      |
 * | IPV6_DROP_MEMBERSHIP  | ipv6_mreq_t       |     Set only    |   No    | No      |
 * | IPV6_PKTINFO          | in6_pktinfo_t     |     None        |   Yes   | Yes     |
 * | IPV6_RCVPKTINFO       | int               |     Set/Get     |   No    | No      |
 * | IPV6_RECVTCLASS       | int               |     Set/Get     |   No    | No      |
 * | IPV6_DONTFRAG         | int               |     Set/Get     |   Yes   | No      |
 * | SO_EDFE_MODE          | uint32_t          |     Set only    |   Yes   | No      |
 */

///@{

/// IPv6 header has a field traffic class that contains a 6-bit
/// Differentiated Services Code Point (DSCP) field that is used for packet
/// classification. By default the packet class level is set to 0 DSCP_DEFAULT.
/// Specify traffic class for outgoing packets, as int;
/// valid values:
/// |     Level     |Description                                                                                        |
/// | :-----------: | :-----------------------------------------------------------------------------------------------: |
/// | DSCP_DEFAULT  | Default level for normal data usage                                                               |
/// | DSCP_AF11     | Higher Application data service for prioritize packet forwarding.                                 |
/// | DSCP_EF       | Expedited Forwarding (EF) for short messages. Allows low loss, low delay, and low jitter services.|
/// |               | This is meant for very important messages like alerts. EF packet length should be kept in         |
/// |               | minimum. This should not be used for any other purpose as it will block other network traffic.    |
#define IPV6_TCLASS                  1
/// Set the unicast hop limit for the socket, as int.
/// Valid values 0 and 255, -1 for using the route default.
#define IPV6_UNICAST_HOPS            2
/// Set the multicast hop limit for the socket, as int.
/// Valid values 0 and 255, -1 for using the route default.
#define IPV6_MULTICAST_HOPS          3
/// Specify PMTU preference, as int;
/// Valid values -1 (PMTUD for unicast, default), 0 (PMTUD always), 1 (PMTUD off).
#define IPV6_USE_MIN_MTU             5
/// Ancillary data option on sendmsg()/recvmsg(), value to be used for single ongoing packet, as int;
/// Valid values 0-255, -1 for default
#define IPV6_HOPLIMIT                8
/// Ancillary data option on recvmsg(), specifies hop-limit for the single received ongoing packet, as int;
/// A nonzero value enables the option; a value of 0 disables the option.
#define IPV6_RECVHOPLIMIT           11
/// Specify whether outgoing multicast packets are looped back, as int.
/// A nonzero value enables the option; a value of 0 disables the option.
#define IPV6_MULTICAST_LOOP         14
/// Join a multicast group. Only valid for SOCK_DGRAM or SOCK_RAW sockets.
/// When set, optval is a pointer to a struct ipv6_mreq.
#define IPV6_ADD_MEMBERSHIP         15
#define IPV6_JOIN_GROUP             IPV6_ADD_MEMBERSHIP
/// Leave a multicast group. Only valid for SOCK_DGRAM or SOCK_RAW sockets.
/// When set, optval is a pointer to a struct ipv6_mreq.
#define IPV6_DROP_MEMBERSHIP        16
#define IPV6_LEAVE_GROUP            IPV6_DROP_MEMBERSHIP
/// Specify control messages packet info for recvmsg() as struct in6_pktinfo.
#define IPV6_PKTINFO                 9
/// Set delivery of the IPV6_PKTINFO control message on incoming datagrams, as int.
/// Such control messages contain a struct in6_pktinfo, as per RFC 3542.
/// Allowed only for SOCK_DGRAM or SOCK_RAW sockets.
#define IPV6_RECVPKTINFO            10
/// Enables the application to receive the value of the traffic class field from the IPv6 header, as int;
/// A nonzero value enables the option; a value of 0 disables the option.
#define IPV6_RECVTCLASS             12
/// Specify not to fragment datagrams, as int;
/// For Wi-SUN, direct neighbors can receive frames up to 1504 bytes,
/// while the other nodes can receive frames up to 1280 bytes.
/// 0 (fragment to path MTU). 1 (no fragmentation, TX fails if bigger than PMTU).
#define IPV6_DONTFRAG                6

/// Experimental: Enable Extended Directed Frame Exchange mode.
/// When set, optval must point to an uint32_t.
#define SO_EDFE_MODE              0xfb
#define SOCKET_EDFE_MODE          SO_EDFE_MODE
///@}

/// Size of an IPv6 address
#define IPV6_ADDR_SIZE 16

/// When bitwise ored with socket's type,
/// it sets the O_NONBLOCK status flag on the opened socket file description
#define SOCK_NONBLOCK 0X00010000

/// Socket address length type definition
typedef uint32_t socklen_t;

/// Address family
typedef uint32_t sa_family_t;

/// Transport layer port
typedef uint16_t in_port_t;

/// Socket id
typedef int sl_wisun_socket_id_t;

/// Enumerations for socket event mode
typedef enum {
  /// SL_WISUN_MSG_SOCKET_DATA_IND_ID is sent to the app with the packet contained in the indication
  SL_WISUN_SOCKET_EVENT_MODE_INDICATION = 0,
  /// SL_WISUN_MSG_SOCKET_DATA_AVAILABLE_IND_ID is sent to the app indicating the amount of data received
  /// recv() or recvfrom() should be invoked after indication reception to retrieve data
  /// This is the default socket event mode option
  SL_WISUN_SOCKET_EVENT_MODE_POLLING    = 1
} sl_wisun_socket_event_mode_t;

/// Supported address families
typedef enum socket_domain {
  AF_INET6 = 0  ///< IP version 6
} sl_socket_domain_t;

/// Socket types
typedef enum socket_type {
  SOCK_STREAM   = 1,  ///< stream (connection) socket (TCP)
  SOCK_DGRAM    = 2,  ///< datagram (connectionless) socket (UDP)
  SOCK_RAW      = 3,  ///< raw socket
} sl_socket_type_t;

/// IP protocols
typedef enum socket_protocol {
  IPPROTO_IP   = 0,  ///< Dummy protocol
  IPPROTO_ICMP = 1,  ///< Internet Control Message Protocol
  IPPROTO_TCP  = 2,  ///< Transmission Control Protocol
  IPPROTO_UDP  = 3,  ///< User Datagram Protocol
} sl_socket_protocol_t;

/// Socket address
struct sockaddr {
  sa_family_t sa_family;    ///< address family, AF_XXXX
  uint8_t     sa_data[26];  ///< 26 bytes of protocol address (IPv6)
};

