CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/protocol/wisun/stack/inc/socket/socket.h
/// IPv6 Internet address
typedef struct in6_addr {
  uint8_t address[IPV6_ADDR_SIZE];  ///< IPv6 address
} in6_addr_t;

/// IPv6 wildcard address
extern const in6_addr_t in6addr_any;

/// IPv6 address format
typedef struct sockaddr_in6 {
    sa_family_t sin6_family;    ///< AF_INET6
    in_port_t   sin6_port;      ///< Transport layer port
    uint32_t    sin6_flowinfo;  ///< IPv6 flow information
    in6_addr_t  sin6_addr;      ///< IPv6 address
    uint32_t    sin6_scope_id;  ///< Scope ID
} sockaddr_in6_t;

/// The msghdr structure is used by the recvmsg() and sendmsg() functions.
typedef struct msghdr {
  void          *msg_name;        ///< ptr to socket address structure
  socklen_t      msg_namelen;     ///< size of socket address structure
  struct iovec  *msg_iov;         ///< scatter/gather array
  int            msg_iovlen;      ///< # elements in msg_iov
  void          *msg_control;     ///< ancillary data
  socklen_t      msg_controllen;  ///< ancillary data buffer length
  int            msg_flags;       ///< flags on received message
} msghdr_t;

/// Control messages
typedef struct cmsghdr {
  socklen_t  cmsg_len;    ///< #bytes, including this header
  int        cmsg_level;  ///< originating protocol
  int        cmsg_type;   ///< protocol-specific type
} cmsghdr_t;

/// Structure to store the IPv6 packet information
typedef struct in6_pktinfo {
    in6_addr_t ipi6_addr;     ///< src/dst IPv6 address
    int        ipi6_ifindex;  ///< arrival interface index
} in6_pktinfo_t;

/// Structure to store scatter/gather array elements
typedef struct iovec {
    void *iov_base;  ///< Store the base address of a memory region for input or output
    size_t iov_len;  ///< Length of the memory region iov_base points to
} iovec_t;

/// Structure to store the IPv6 MTU (Maximum Transmission Unit) information
typedef struct ip6_mtuinfo {
  /// IPv6 address
  struct sockaddr_in6 ip6m_addr;
  /// MTU size
  uint32_t ip6m_mtu;
} ip6_mtuinfo_t;

/// Structure to specify the multicast group and the interface
typedef struct ipv6_mreq {
  /// IPv6 multicast address of group
  struct in6_addr ipv6mr_multiaddr;
  /// Local IPv6 address of interface
  int ipv6mr_ifindex;
} ipv6_mreq_t;

/**************************************************************************//**
 * Creates an endpoint for communication and returns an Id that refers to that
 * endpoint.
 *
 * @param[in] domain Specifies a communication domain. It selects the protocol
 *                   family which will be used for communication. Must be set
 *                   to AF_INET6 (IPv6 network socket)
 * @param[in] type The communication semantics
 *                   It can be:
 *                      - #SOCK_STREAM  - TCP stream socket type
 *                      - #SOCK_DGRAM   - UDP datagram socket type
 *                      - #SOCK_RAW     - Raw Socket type (ICMP)
 * @param[in] protocol Specifies the particular protocol to be used.
 *                   It can be:
 *                      - #IPPROTO_ICMP  - Ping
 *                      - #IPPROTO_IP and IPPROTO_TCP  - TCP stream sockets
 *                      - #IPPROTO_IP and IPPROTO_UDP  - UDP datagram sockets
 * @return The socket's id on success, (-1) on failure.
 *****************************************************************************/
int socket(int domain, int type, int protocol);

/**************************************************************************//**
 * Close a socket.
 *
 * @param[in] sockid socket id
 * @return 0 on success, -1 on failure.
 *
 * Close a socket and remove from the socket handler storage.
 *****************************************************************************/
#ifndef DOXYGEN_SHOULD_SKIP_THIS

int sl_close(int sockid);

#define close(sockid) sl_close(sockid)
#else
int close(int sockid);
#endif
/**************************************************************************//**
 * Bind a name to a socket.
 *
 * @param[in] sockid socket id
 * @param[in] addr address structure ptr
 * @param[in] addrlen address structure size
 * @return 0 on success, -1 on failure.
 *
 * Assigns the address to the socket, referred to by the socket ID, as specified
 * by addr. It is normally necessary to assign a local address using bind()
 * before a #SOCK_STREAM socket may receive connections.
 *****************************************************************************/
int bind(int sockid, const struct sockaddr *addr, socklen_t addrlen);

/**************************************************************************//**
 * Send a message on a socket.
 *
 * @param[in] sockid socket descriptor.
 * @param[in] buff pointer to data buffer to send.
 * @param[in] len length of data buffer to send.
 * @param[in] flags flags to select send options. Ignored in our implementation.
 * @return The number of bytes sent on success, -1 if an error occurred.
 *
 * Preferred with connection-oriented sockets (TCP).
 *****************************************************************************/
ssize_t send(int sockid, const void *buff, size_t len, int flags);

/**************************************************************************//**
 * Send a message to a given address.
 *
 * @param[in] sockid socket descriptor.
 * @param[in] buff pointer to data buffer to send.
 * @param[in] len length of data buffer to send.
 * @param[in] flags flags to select send options. Ignored in our implementation.
 * @param[in] dest_addr pointer to destination address buffer; Required for datagram sockets.
 * @param[in] addr_len length of  destination address buffer.
 * @return The number of bytes sent on success, -1 if an error occurred.
 *
 * Preferred in datagram mode (UDP).
 *****************************************************************************/
ssize_t sendto(int sockid, const void *buff, size_t len,
               int flags, const struct sockaddr *dest_addr, socklen_t addr_len);

/**
 * Send a message through a connection-mode or connectionless-mode socket.
 *
 * @param[in] socket  Specifies the socket file descriptor.
 * @param[in] message Points to a msghdr structure, containing both the
                      destination address and the buffers for the outgoing
                      message.
 * @param[in] flags   Specifies the type of message transmission.
 * @return            The number of bytes received on success, -1 if an error occurred.
 */
ssize_t sendmsg(int socket, const struct msghdr *message, int flags);

/**************************************************************************//**
 * Receive messages from a socket
 *
 * @param[in] sockid descriptor of socket to receive the message from.
 * @param[out] buf pointer to destination data buffer.
 * @param[in] len length of destination data buffer.
 * @param[in] flags flags to select type of message reception. Ignored in our
 *            implementation.
 * @param[in] src_addr pointer to a sockaddr structure in which the sending
 *                     address is to be stored.
 * @param[in] addrlen length of the supplied sockaddr structure.
 * @return The number of bytes received on success, -1 if an error occurred.
 *
 * Receives data on a socket whether or not it is connection-oriented.
 *****************************************************************************/
ssize_t recvfrom(int sockid, void *buf, size_t len, int flags,
                 struct sockaddr *src_addr, socklen_t *addrlen);

/**************************************************************************//**
 * Receive a message from a socket.
 *
 * @param[in] sockid descriptor of socket to receive the message from.
 * @param[out] buf pointer to destination data buffer.
 * @param[in] len length of destination data buffer.
 * @param[in] flags flags to select type of message reception. Ignored in our
 *            implementation.
 * @return The number of bytes received on success, -1 if an error occurred.
 *
 * Should be used for connection-oriented protocol (TCP)
 *****************************************************************************/
ssize_t recv(int sockid, void *buf, size_t len, int flags);

/**
 * @brief Receive a message from a connection-mode or connectionless-mode socket.
 *        It is normally used with connectionless-mode sockets because it permits
 *        the application to retrieve the source address of received data.
 *
 * @param socket Specifies the socket file descriptor.
 * @param message Points to a msghdr structure, containing both the
                  buffer to store the source address and the buffers
                  for the incoming message.
 * @param flags Specifies the type of message reception.
 * @return
 */
ssize_t recvmsg(int socket, struct msghdr *message, int flags);

/**************************************************************************//**
 * Accept a connection on a socket.
 *
 * @param[in] sockid socket descriptor
 * @param[in,out] addr A pointer to sockaddr structure filled in with the address
 *                of the peer (remote) socket. When addr is NULL, nothing is
 *                filled in; in this case, addrlen is not used, and should also
 *                be NULL.
 *
 * @param[in,out] addrlen The caller must initialize it to contain the size (in
 *                bytes) of the structure pointed to by addr. On return it will
 *                contain the actual size of the peer address.
 * @return The socket id of the accepted socket on success, -1 if an error occurred.
 *
 * Used with connection-based socket types (TCP).
 * It extracts the first connection request on the queue of pending connections for the
 * listening socket.
 *****************************************************************************/
int accept(int sockid, struct sockaddr *addr, socklen_t *addrlen);

/**************************************************************************//**
 * Initiate a connection on a socket.
 *
 * @param[in] sockid socket descriptor.
 * @param[in] addr If the socket sockid is of type #SOCK_DGRAM, addr is the address
 *            to which datagrams are sent by default and the only address from
 *            which datagrams are received.
 *            If the socket is of type #SOCK_STREAM, this call attempts to make a
 *            connection to the socket that is bound to the address specified by addr.
 * @param[in] addrlen length of the supplied sockaddr structure.
 * @return 0 on connection or binding success, -1 if an error occurred.
 *
 * Connects the socket referred to by the sockid to the address specified by address.
 *****************************************************************************/
int connect(int sockid, const struct sockaddr *addr, socklen_t addrlen);

/**************************************************************************//**
 * Listen for connections on a socket.
 *
 * @param[in] sockid socket id
 * @param[in] backlog Argument defines the maximum length to
 *                    which the queue of pending connections for sockid may grow.
 *                    Not implemented for Wi-SUN, the connection queue size is always 1
 * @return 0 on success, -1 if an error occurred.
 *
 * Marks the socket referred to by sockid as a passive socket, that is, as a
 * socket that will be used to accept incoming connection requests using accept.
 *****************************************************************************/
int listen(int sockid, int backlog);

/**************************************************************************//**
 * Set socket option designated by optname at a given protocol level to the
 * value pointed by optval.
 * @param[in] sockid socket ID
 * @param[in] level protocol level at which the option resides.
 *                  it could be:
 *                    - #SOL_SOCKET
 *                    - #IPPROTO_IPV6
 *                    - #SOL_APPLICATION
 * @param[in] optname option name.
 *                    it could be:
 *                      - for #SOL_SOCKET level:
 *                          - #SO_RCVBUF
 *                          - #SO_SNDBUF
 *                          - #SO_SNDLOWAT
 *                      - for #IPPROTO_IPV6 level:
 *                          - #IPV6_UNICAST_HOPS
 *                          - #IPV6_MULTICAST_HOPS
 *                          - #IPV6_JOIN_GROUP
 *                          - #IPV6_LEAVE_GROUP
 *                          - #SO_EDFE_MODE
 *                      - for #SOL_APPLICATION:
 *                          - #SO_EVENT_MODE
 *                          - #SO_NONBLOCK
 * @param[in] optval Pointer to the socket option new value. The type
 *                   of variable pointed by optval depends level and
 *                   optname values.
 * @param[in] optlen Must be the size of the symbol pointed by optval.
 * @return 0 on success, -1 if an error occurred.
 *
 * This function can set socket properties.
 *****************************************************************************/
int setsockopt(int sockid, int level, int optname,
               const void *optval, socklen_t optlen);

/**************************************************************************//**
 * Get socket option.
 *
 * @param[in] sockid socket descriptor.
 * @param[in] level socket protocol level.
 * @param[in] optname Option name.
 *                    Supported options:
 *                      - for #SOL_SOCKET level:
 *                          - #SO_RCVBUF
 *                          - #SO_SNDBUF
 *                          - #SO_SNDLOWAT
 *                      - for #IPPROTO_IPV6 level:
 *                          - #IPV6_UNICAST_HOPS
 *                          - #IPV6_MULTICAST_HOPS
 * @param[out] optval option value structure pointer.
 * @param[in] optlen size of the option value structure.
 * @return 0 on success, -1 if an error occurred.
 *
 * The function gets socket option by optname, and copies option data to optval ptr.
 *****************************************************************************/
int getsockopt(int sockid, int level, int optname,
               void *optval, socklen_t *optlen);

/**************************************************************************//**
 * Convert the long host byte order to network order.
 *
 * @param[in] hostlong Long host integer
 * @return Long network integer
 *
 * This function converts the unsigned integer hostlong from host byte order to network byte order.
 * For Wi-SUN, the conversion is not needed. Dummy implementation
 *****************************************************************************/
__STATIC_INLINE uint32_t htonl(uint32_t hostlong)
{
  return hostlong;
}

/**************************************************************************//**
 * Convert the short host byte order to network order.
 *
 * @param[in] hostshort Short host integer
 * @return Short network integer
 *
 * This function converts the unsigned short integer hostshort from host byte order to network byte order.
 * For Wi-SUN, the conversion is not needed. Dummy implementation
 *****************************************************************************/
__STATIC_INLINE uint16_t htons(uint16_t hostshort)
{
  return hostshort;
}

/**************************************************************************//**
 * Convert the long network byte order to host byte order.
 *
 * @param[in] netlong Long network integer
 * @return Long host integer
 *
 * This function converts the unsigned integer netlong from network byte order to host byte order.
 * For Wi-SUN, the conversion is not needed. Dummy implementation
 *****************************************************************************/
__STATIC_INLINE uint32_t ntohl(uint32_t netlong)
{
  return netlong;
}

/**************************************************************************//**
 * Convert the short network byte order to host byte order.
 *
 * @param[in] netshort
 * @return Short host integer
 *
 * This function converts the unsigned short integer netshort from the network
 * byte order to host byte order.For Wi-SUN, the conversion is not needed.
 * Dummy implementation.
 *****************************************************************************/
__STATIC_INLINE uint16_t ntohs(uint16_t netshort)
{
  return netshort;
}

/**************************************************************************//**
 * Convert the IPv4 and IPv6 addresses from text to binary form.
 *
 * @param[in] af The address family. Only AF_INET6 is supported by our implementation.
 * @param[in] src Source string
 * @param[out] dst Destination address pointer
 * @return 1 on succes, -1 if an error occurred. (POSIX described the 0 value too)
 *
 * This function converts the character string src into a network address structure
 * in the af address family, then copies the network address structure to dst.
 * AF_INET (IPv4) case not supported.
 *****************************************************************************/
int32_t inet_pton(int32_t af, const char *src, void *dst);

/**************************************************************************//**
 * Convert IPv6 addresses from binary to text form.
 *
 * @param[in] af - Address family.
 *               - Only AF_INET6 is supported
 * @param[in] src Source address in byte form
 * @param[out] dst Destination buffer ptr
 * @param[in] size Size of the destination buffer.
 * @return It returns a non-null pointer to dst. NULL if an error occurred.
 *
 * Converts the network address structure src in the af address family into a character string.
 * The resulting string is copied to the buffer pointed to by dst,
 * which must be a non-null pointer.
 * The caller specifies the number of bytes available in this buffer in the argument size.
 * AF_INET (IPv4) case not supported.
 *****************************************************************************/
const char *inet_ntop(int32_t af, const void *src, char *dst, socklen_t size);

/** @} */

/**
 * @brief Returns the next control message header in a message header structure.
 * @param msgh A pointer to a msghdr_t structure that contains the ancillary data buffer.
 * @param cmsg A pointer to a cmsghdr_t structure that represents the current control message header.
 * @return A pointer to the next control message header, or NULL if there are no more control messages in the buffer.
 * @see CMSG_FIRSTHDR, CMSG_ALIGN
 */
static inline cmsghdr_t *cmsg_nxthdr(const msghdr_t *msgh, cmsghdr_t *cmsg)
{
    uint8_t *start_of_next_header = NULL;
    uint8_t *end_of_next_header = NULL;
    if (!cmsg) {
        return CMSG_FIRSTHDR(msgh);
    }
    start_of_next_header = (uint8_t *)(cmsg) + CMSG_ALIGN(cmsg->cmsg_len);
    end_of_next_header   = start_of_next_header + CMSG_ALIGN(sizeof(cmsghdr_t));
    if (end_of_next_header > (uint8_t *)(msgh->msg_control) + msgh->msg_controllen) {
        return NULL;
    }
    return (cmsghdr_t *) start_of_next_header;
}

#ifdef __cplusplus
}
#endif

#endif /* End socket.h */